#Python - Non-technical introduction

##Day 2 Session 2: "Select the needle in a haystack: How to use “select” operations?"

This file accompanies the lectures and provides the code for the corresponding slides.

*Note:* If you want to make changes to this document, you need to save your own copy using the "Save copy in Drive" command in the "File" menu.

###Preparation

**Make sure to run the follwing code before continuing.** Code will prepare everything (load data, ...).

In [ ]:
#load the Pandas package
import pandas as pd
#Read the csv file and store it in the variable "myData". Note: this file is hostes in a GitHub repository.
myData=pd.read_csv(filepath_or_buffer="https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/transactions.csv", sep=",")
# Adjust the format of column "TransDate" to datetime
myData["TransDate"]  = pd.to_datetime(myData["TransDate"])

###16 - Data wrangling techniques

No code for this unit.

###17 - Selecting rows

####**Slide:** Selecting rows by row numbers
 - Select the first row

In [ ]:
#get a series as output
myData.iloc [0, ]

Customer                    149332
TransDate      2005-11-15 00:00:00
Quantity                         1
PurchAmount                 199.95
Cost                           107
TransID                  127998739
Name: 0, dtype: object

In [ ]:
#get a DataFrame as output
myData.iloc [[0], ]

   Customer  TransDate  Quantity  PurchAmount   Cost    TransID
0    149332 2005-11-15         1       199.95  107.0  127998739

####**Slide:** Selecting rows by row numbers
 - Select the first 3 rows

In [ ]:
myData.iloc[0:3, ]

   Customer  TransDate  Quantity  PurchAmount   Cost    TransID
0    149332 2005-11-15         1       199.95  107.0  127998739
1    172951 2008-08-29         1       199.95  108.0  128888288
2    120621 2007-10-19         1        99.95   49.0  125375247

####**Slide:** Selecting rows by row numbers
 - Select the first 3 and the 5th row

In [ ]:
myData.iloc[[0,1,2,4], ]

   Customer  TransDate  Quantity  PurchAmount   Cost    TransID
0    149332 2005-11-15         1       199.95  107.0  127998739
1    172951 2008-08-29         1       199.95  108.0  128888288
2    120621 2007-10-19         1        99.95   49.0  125375247
4    149236 2007-12-06         1        79.95   35.0  128670302

####**Slide:** Python Basics: Understand the dimensions of your DataFrame

In [ ]:
#Number of rows
myData.shape[0]

223191

In [ ]:
#Number of columns

myData.shape[1]

6

In [ ]:
#Length of a vector

len([2,3,5])

3

In [ ]:
#Length of string:
len("hello")

5

####**Slide:** Selecting rows by row numbers
 - Select the first 3 and the 5th row

In [ ]:
#Variant 1
myData.iloc[[len(myData)-1], ]

        Customer  TransDate  Quantity  PurchAmount  Cost    TransID
223190    199542 2012-09-17         1        39.95  10.5  131973368

In [ ]:
#Variant 2
myData.tail(1)

        Customer  TransDate  Quantity  PurchAmount  Cost    TransID
223190    199542 2012-09-17         1        39.95  10.5  131973368

####**Slide:** Sidenote: How to sort your DataFrame

In [ ]:
#To sort your DataFrame according to transaction dates (increasing) use

myData.sort_values(["TransDate"])

        Customer  TransDate  Quantity  PurchAmount    Cost    TransID
44171     100289 2004-12-16         1        21.95   10.00  124284670
44127     173470 2004-12-16         1        49.95   23.50  130656050
40883     100292 2004-12-16         1        49.95   24.00  124285052
11237     144478 2004-12-16         1        59.95   24.50  127833251
40882     100292 2004-12-16         1        59.95   27.00  124285052
...          ...        ...       ...          ...     ...        ...
183001    157039 2012-09-17         1        69.95   26.40  131973369
223189    199999 2012-09-17         1       179.95  109.99  132481165
177256    192254 2012-09-17         1        69.95   28.57  131973243
18342     187155 2012-09-17         1        79.95   32.00  130062663
223190    199542 2012-09-17         1        39.95   10.50  131973368

[223191 rows x 6 columns]

In [ ]:
#Order first according to transaction dates and then according to customers

myData.sort_values(["TransDate", "Customer"])

        Customer  TransDate  Quantity  PurchAmount    Cost    TransID
33827     100287 2004-12-16         1        59.95   22.00  124284041
44156     100288 2004-12-16         1        99.95   49.98  124284512
44168     100289 2004-12-16         1       129.95   58.25  124284670
44169     100289 2004-12-16         1        35.95   17.50  124284670
44170     100289 2004-12-16         1        69.95   31.25  124284670
...          ...        ...       ...          ...     ...        ...
223185    199997 2012-09-17         1        29.95   13.80  132481149
223186    199997 2012-09-17         1        29.95   13.80  132481149
223187    199997 2012-09-17         1        29.95   13.80  132481149
223188    199998 2012-09-17         1        29.95   13.80  132481154
223189    199999 2012-09-17         1       179.95  109.99  132481165

[223191 rows x 6 columns]

In [ ]:
#Order decreasing
myData.sort_values(["TransDate", "Customer"], ascending=[0,0])

        Customer  TransDate  Quantity  PurchAmount    Cost    TransID
223189    199999 2012-09-17         1       179.95  109.99  132481165
223188    199998 2012-09-17         1        29.95   13.80  132481154
223182    199997 2012-09-17         1        29.95   13.80  132481149
223183    199997 2012-09-17         1        29.95   13.80  132481149
223184    199997 2012-09-17         1        29.95   13.80  132481149
...          ...        ...       ...          ...     ...        ...
44169     100289 2004-12-16         1        35.95   17.50  124284670
44170     100289 2004-12-16         1        69.95   31.25  124284670
44171     100289 2004-12-16         1        21.95   10.00  124284670
44156     100288 2004-12-16         1        99.95   49.98  124284512
33827     100287 2004-12-16         1        59.95   22.00  124284041

[223191 rows x 6 columns]

####**Slide:** Selecting rows by condition
 - Identify transactions greater than $100

In [ ]:
myData.loc[myData["PurchAmount"] > 100, ]

        Customer  TransDate  Quantity  PurchAmount    Cost    TransID
0         149332 2005-11-15         1       199.95  107.00  127998739
1         172951 2008-08-29         1       199.95  108.00  128888288
5         140729 2009-11-19         1       129.95   59.00  127637750
11        180970 2009-06-19         1       119.95   58.46  129195647
17        182927 2009-11-02         1       129.95   63.08  129290963
...          ...        ...       ...          ...     ...        ...
223164    199539 2012-09-16         1       119.95   40.25  131972445
223166    186343 2012-09-16         1       129.95   63.00  129599231
223167    186344 2012-09-16         1       149.95   54.50  129599281
223176    199996 2012-09-17         1       179.95  104.99  132481133
223189    199999 2012-09-17         1       179.95  109.99  132481165

[46292 rows x 6 columns]

####**Slide:** Selecting rows by condition
 - Select the transactions of a single customer

In [ ]:
myData.loc[myData["Customer"] == 149332, ]

    Customer  TransDate  Quantity  PurchAmount    Cost    TransID
0     149332 2005-11-15         1       199.95  107.00  127998739
13    149332 2005-12-13         1        49.95   24.87  129878743
14    149332 2006-05-10         1        24.95   12.50  129883508

####**Slide:** Selecting rows by condition
Select the transactions of multiple customers

In [ ]:
myData.loc[myData["Customer"].isin([149332, 172951]), ]

    Customer  TransDate  Quantity  PurchAmount    Cost    TransID
0     149332 2005-11-15         1       199.95  107.00  127998739
1     172951 2008-08-29         1       199.95  108.00  128888288
13    149332 2005-12-13         1        49.95   24.87  129878743
14    149332 2006-05-10         1        24.95   12.50  129883508
22    172951 2008-08-29         1       249.95  162.50  128888288
23    172951 2008-08-29         1       349.95  187.50  128888288
24    172951 2009-01-28         1        89.95   44.98  129113804

####**Slide**: Tilde operator (~) precedes an index vector to negate the condition

In [ ]:
myData.loc[~ myData["Customer"].isin([149332, 172951]), ]

        Customer  TransDate  Quantity  PurchAmount    Cost    TransID
2         120621 2007-10-19         1        99.95   49.00  125375247
3         149236 2005-11-14         1        39.95   18.95  127996226
4         149236 2007-12-06         1        79.95   35.00  128670302
5         140729 2009-11-19         1       129.95   59.00  127637750
6         140729 2009-11-19         1        79.95   39.18  127637750
...          ...        ...       ...          ...     ...        ...
223186    199997 2012-09-17         1        29.95   13.80  132481149
223187    199997 2012-09-17         1        29.95   13.80  132481149
223188    199998 2012-09-17         1        29.95   13.80  132481154
223189    199999 2012-09-17         1       179.95  109.99  132481165
223190    199542 2012-09-17         1        39.95   10.50  131973368

[223184 rows x 6 columns]

####**Slide:** Combining conditions

In [ ]:
myData.loc[(myData["TransDate"]>
	pd.to_datetime("2007-10-24")) & (myData["PurchAmount"]>100), ]

        Customer  TransDate  Quantity  PurchAmount    Cost    TransID
1         172951 2008-08-29         1       199.95  108.00  128888288
5         140729 2009-11-19         1       129.95   59.00  127637750
11        180970 2009-06-19         1       119.95   58.46  129195647
17        182927 2009-11-02         1       129.95   63.08  129290963
22        172951 2008-08-29         1       249.95  162.50  128888288
...          ...        ...       ...          ...     ...        ...
223164    199539 2012-09-16         1       119.95   40.25  131972445
223166    186343 2012-09-16         1       129.95   63.00  129599231
223167    186344 2012-09-16         1       149.95   54.50  129599281
223176    199996 2012-09-17         1       179.95  104.99  132481133
223189    199999 2012-09-17         1       179.95  109.99  132481165

[33617 rows x 6 columns]

###18 - Selecting columns

####**Slide:** Select a single column by column name/number (1/2)

In [ ]:
#by name
myData.loc[ : , "TransDate"]

0        2005-11-15
1        2008-08-29
2        2007-10-19
3        2005-11-14
4        2007-12-06
            ...
223186   2012-09-17
223187   2012-09-17
223188   2012-09-17
223189   2012-09-17
223190   2012-09-17
Name: TransDate, Length: 223191, dtype: datetime64[ns]

In [ ]:
#by number
myData.iloc[ : , 1]

0        2005-11-15
1        2008-08-29
2        2007-10-19
3        2005-11-14
4        2007-12-06
            ...
223186   2012-09-17
223187   2012-09-17
223188   2012-09-17
223189   2012-09-17
223190   2012-09-17
Name: TransDate, Length: 223191, dtype: datetime64[ns]

In [ ]:
#by name (for lazy people)
myData["TransDate"]

0        2005-11-15
1        2008-08-29
2        2007-10-19
3        2005-11-14
4        2007-12-06
            ...
223186   2012-09-17
223187   2012-09-17
223188   2012-09-17
223189   2012-09-17
223190   2012-09-17
Name: TransDate, Length: 223191, dtype: datetime64[ns]

####**Slide:** Select a single column by column name/number (2/2)

In [ ]:
#by name (compare the output to the previous slide!)
myData.loc[ : , "TransDate"].values

array(['2005-11-15T00:00:00.000000000', '2008-08-29T00:00:00.000000000',
       '2007-10-19T00:00:00.000000000', ...,
       '2012-09-17T00:00:00.000000000', '2012-09-17T00:00:00.000000000',
       '2012-09-17T00:00:00.000000000'], dtype='datetime64[ns]')

In [ ]:
#by number (compare the output to the previous slide!)
myData.iloc[ : , 1].values

array(['2005-11-15T00:00:00.000000000', '2008-08-29T00:00:00.000000000',
       '2007-10-19T00:00:00.000000000', ...,
       '2012-09-17T00:00:00.000000000', '2012-09-17T00:00:00.000000000',
       '2012-09-17T00:00:00.000000000'], dtype='datetime64[ns]')

In [ ]:
#by name (for lazy people) (Compare the output to the previous slide!)
myData ["TransDate"].values

array(['2005-11-15T00:00:00.000000000', '2008-08-29T00:00:00.000000000',
       '2007-10-19T00:00:00.000000000', ...,
       '2012-09-17T00:00:00.000000000', '2012-09-17T00:00:00.000000000',
       '2012-09-17T00:00:00.000000000'], dtype='datetime64[ns]')

####**Slide:** Select multiple columns by column name/number

In [ ]:
#by name
myData.loc[ : , ["Customer", "TransDate", "PurchAmount"]]

        Customer  TransDate  PurchAmount
0         149332 2005-11-15       199.95
1         172951 2008-08-29       199.95
2         120621 2007-10-19        99.95
3         149236 2005-11-14        39.95
4         149236 2007-12-06        79.95
...          ...        ...          ...
223186    199997 2012-09-17        29.95
223187    199997 2012-09-17        29.95
223188    199998 2012-09-17        29.95
223189    199999 2012-09-17       179.95
223190    199542 2012-09-17        39.95

[223191 rows x 3 columns]

In [ ]:
#by number
myData.iloc[ : , [0,1,3]]

        Customer  TransDate  PurchAmount
0         149332 2005-11-15       199.95
1         172951 2008-08-29       199.95
2         120621 2007-10-19        99.95
3         149236 2005-11-14        39.95
4         149236 2007-12-06        79.95
...          ...        ...          ...
223186    199997 2012-09-17        29.95
223187    199997 2012-09-17        29.95
223188    199998 2012-09-17        29.95
223189    199999 2012-09-17       179.95
223190    199542 2012-09-17        39.95

[223191 rows x 3 columns]

In [ ]:

#by name (for lazy people)
myData[["Customer", "TransDate", "PurchAmount"]]

        Customer  TransDate  PurchAmount
0         149332 2005-11-15       199.95
1         172951 2008-08-29       199.95
2         120621 2007-10-19        99.95
3         149236 2005-11-14        39.95
4         149236 2007-12-06        79.95
...          ...        ...          ...
223186    199997 2012-09-17        29.95
223187    199997 2012-09-17        29.95
223188    199998 2012-09-17        29.95
223189    199999 2012-09-17       179.95
223190    199542 2012-09-17        39.95

[223191 rows x 3 columns]

####**Slide:** Python Basics: Find out the column names

In [ ]:
myData.columns.values

array(['Customer', 'TransDate', 'Quantity', 'PurchAmount', 'Cost',
       'TransID'], dtype=object)

####**Slide:** Combine operations to select by rows and columns

In [ ]:
#Variante 1:
myData.loc[ myData["PurchAmount"]>100 , ["TransDate","Cost"]]

        TransDate    Cost
0      2005-11-15  107.00
1      2008-08-29  108.00
5      2009-11-19   59.00
11     2009-06-19   58.46
17     2009-11-02   63.08
...           ...     ...
223164 2012-09-16   40.25
223166 2012-09-16   63.00
223167 2012-09-16   54.50
223176 2012-09-17  104.99
223189 2012-09-17  109.99

[46292 rows x 2 columns]

In [ ]:
#Variant 2:
myData[["TransDate","Cost"]].loc[ myData["PurchAmount"]>100 ,]

        TransDate    Cost
0      2005-11-15  107.00
1      2008-08-29  108.00
5      2009-11-19   59.00
11     2009-06-19   58.46
17     2009-11-02   63.08
...           ...     ...
223164 2012-09-16   40.25
223166 2012-09-16   63.00
223167 2012-09-16   54.50
223176 2012-09-17  104.99
223189 2012-09-17  109.99

[46292 rows x 2 columns]

###19 - Updating rows and columns

####**Slide:** Appending rows into DataFrame

In [ ]:
myData.append(pd.DataFrame([[199332, pd.to_datetime("2011-11-18"),
			1,99.95,47.00, 197923739]],
			columns=myData.columns.values),
	ignore_index=True)

####**Slide:** Adding columns to a DataFrame

In [ ]:
myData["NewCol"] = myData["Cost"].round()

####**Slide:** Python Basics: By default DataFrame changes are made by reference

In [ ]:
myData.head(3)

In [ ]:
myData_modified=myData
myData_modified["NewCol2"] = myData["Cost"].round()
myData_modified.head(10)

   Customer  TransDate  Quantity  PurchAmount    Cost    TransID  NewCol2
0    149332 2005-11-15         1       199.95  107.00  127998739    107.0
1    172951 2008-08-29         1       199.95  108.00  128888288    108.0
2    120621 2007-10-19         1        99.95   49.00  125375247     49.0
3    149236 2005-11-14         1        39.95   18.95  127996226     19.0
4    149236 2007-12-06         1        79.95   35.00  128670302     35.0
5    140729 2009-11-19         1       129.95   59.00  127637750     59.0
6    140729 2009-11-19         1        79.95   39.18  127637750     39.0
7    140729 2009-11-19         1        24.95   11.50  127637750     12.0
8    140729 2009-11-19         1         7.95    2.96  127637750      3.0
9    140729 2012-04-28         1        89.95   35.00  129377737     35.0

In [ ]:
#Ups! Also modified!
myData.head(10)

   Customer  TransDate  Quantity  PurchAmount    Cost    TransID  NewCol2
0    149332 2005-11-15         1       199.95  107.00  127998739    107.0
1    172951 2008-08-29         1       199.95  108.00  128888288    108.0
2    120621 2007-10-19         1        99.95   49.00  125375247     49.0
3    149236 2005-11-14         1        39.95   18.95  127996226     19.0
4    149236 2007-12-06         1        79.95   35.00  128670302     35.0
5    140729 2009-11-19         1       129.95   59.00  127637750     59.0
6    140729 2009-11-19         1        79.95   39.18  127637750     39.0
7    140729 2009-11-19         1        24.95   11.50  127637750     12.0
8    140729 2009-11-19         1         7.95    2.96  127637750      3.0
9    140729 2012-04-28         1        89.95   35.00  129377737     35.0

In [ ]:
#reset the dataset by reading it again
#Read the csv file and store it in the variable "myData". Note: this file is hostes in a GitHub repository.
myData=pd.read_csv(filepath_or_buffer="https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/transactions.csv", sep=",")
# Adjust the format of column "TransDate" to datetime
myData["TransDate"]  = pd.to_datetime(myData["TransDate"])

In [ ]:
#use copy() to prevent by reference modfications!
myData_modified = myData.copy()

####**Slide:** Remove a single column from a DataFrame

In [ ]:
del myData["Quantity"]

In [ ]:
#reset the dataset by reading it again
#Read the csv file and store it in the variable "myData". Note: this file is hostes in a GitHub repository.
myData=pd.read_csv(filepath_or_buffer="https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/transactions.csv", sep=",")
# Adjust the format of column "TransDate" to datetime
myData["TransDate"]  = pd.to_datetime(myData["TransDate"])

####**Slide:** Remove multiple columns at the same time

In [ ]:
myData.drop(["Quantity", "Cost"], axis=1)

        Customer  TransDate  PurchAmount    TransID
0         149332 2005-11-15       199.95  127998739
1         172951 2008-08-29       199.95  128888288
2         120621 2007-10-19        99.95  125375247
3         149236 2005-11-14        39.95  127996226
4         149236 2007-12-06        79.95  128670302
...          ...        ...          ...        ...
223186    199997 2012-09-17        29.95  132481149
223187    199997 2012-09-17        29.95  132481149
223188    199998 2012-09-17        29.95  132481154
223189    199999 2012-09-17       179.95  132481165
223190    199542 2012-09-17        39.95  131973368

[223191 rows x 4 columns]

In [ ]:
#reset the dataset by reading it again
#Read the csv file and store it in the variable "myData". Note: this file is hostes in a GitHub repository.
myData=pd.read_csv(filepath_or_buffer="https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/transactions.csv", sep=",")
# Adjust the format of column "TransDate" to datetime
myData["TransDate"]  = pd.to_datetime(myData["TransDate"])

####**Slide:** Python Basics: Change the names of a variable in a DataFrame

In [ ]:
myData.rename(columns = {"PurchAmount":"TransValue"}, inplace=True)
print(myData)

        Customer  TransDate  Quantity  TransValue    Cost    TransID
0         149332 2005-11-15         1      199.95  107.00  127998739
1         172951 2008-08-29         1      199.95  108.00  128888288
2         120621 2007-10-19         1       99.95   49.00  125375247
3         149236 2005-11-14         1       39.95   18.95  127996226
4         149236 2007-12-06         1       79.95   35.00  128670302
...          ...        ...       ...         ...     ...        ...
223186    199997 2012-09-17         1       29.95   13.80  132481149
223187    199997 2012-09-17         1       29.95   13.80  132481149
223188    199998 2012-09-17         1       29.95   13.80  132481154
223189    199999 2012-09-17         1      179.95  109.99  132481165
223190    199542 2012-09-17         1       39.95   10.50  131973368

[223191 rows x 6 columns]

In [ ]:
#reset the dataset by reading it again
#Read the csv file and store it in the variable "myData". Note: this file is hostes in a GitHub repository.
myData=pd.read_csv(filepath_or_buffer="https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/transactions.csv", sep=",")
# Adjust the format of column "TransDate" to datetime
myData["TransDate"]  = pd.to_datetime(myData["TransDate"])

####**Slide:** Remove rows from a DataFrame

In [ ]:
myData.drop(myData.index[0:3], inplace=True)

In [ ]:
#reset the dataset by reading it again
#Read the csv file and store it in the variable "myData". Note: this file is hostes in a GitHub repository.
myData=pd.read_csv(filepath_or_buffer="https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/transactions.csv", sep=",")
# Adjust the format of column "TransDate" to datetime
myData["TransDate"]  = pd.to_datetime(myData["TransDate"])